In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [41]:
lst = ["Hussam","Saleh","sami",] 
a = pd.Series(lst,index=[1,2,3])
a

1    Hussam
2     Saleh
3      sami
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [42]:
a.index = [11,12,13]
a

11    Hussam
12     Saleh
13      sami
dtype: object

## Q3: Retrieve First and second elements.

In [19]:
a[0:2]

11    1
12    2
dtype: int64

## Q4: Add duplicate elements, then remove the duplication.

In [23]:
a1 = pd.Series({14: 3,})
a = a.append(a1)
a

C:\Users\abo7s\AppData\Local\Temp\ipykernel_7804\695252698.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  a = a.append(a1)

11    1
12    2
13    3
14    3
dtype: int64

In [24]:
a.drop_duplicates()

11    1
12    2
13    3
dtype: int64

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [30]:
 data = {'ID': [],
        'Name': [],
        'GPA':   [],
        }
   
st= pd.DataFrame(data, columns=['ID', 'Name', 'GPA'])
st

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [31]:
f=pd.read_csv("educ_figdp_1_Data.csv")
f

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [35]:
f.loc[2:6,['GEO','TIME']]

                             GEO  TIME
2  European Union (28 countries)  2002
3  European Union (28 countries)  2003
4  European Union (28 countries)  2004
5  European Union (28 countries)  2005
6  European Union (28 countries)  2006

In [38]:
f[2:6]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e